josephcabrera-cmyk/Blindsight-Claritone-Senior-Design/Object Detection/STM32N6/Application/NUCLEO-N657X0-Q/Src/main.c
    while (cameraFrameReceived == 0) {}
    cameraFrameReceived = 0;

    uint32_t ts[2] = {0};

#if DCMIPP_NN_NEEDS_CROP
    SCB_InvalidateDCache_by_Addr(dcmipp_out_nn, sizeof(dcmipp_out_nn));
    img_crop(dcmipp_out_nn, nn_in, pitch_nn, STAI_NETWORK_IN_1_WIDTH, STAI_NETWORK_IN_1_HEIGHT, STAI_NETWORK_IN_1_CHANNEL);
    SCB_CleanInvalidateDCache_by_Addr(nn_in, nn_in_len);
#endif

    ts[0] = HAL_GetTick();
    ret = stai_network_run(network_context, STAI_MODE_SYNC);
    assert(ret == 0);
    ts[1] = HAL_GetTick();

    ret = app_postprocess_run((void **)nn_out, number_output, &pp_output, &pp_params);
    assert(ret == 0);

    Claritone_HandleFrame(&pp_output);

    /* Optional: keep this call if you later attach a display.
       If you want a cleaner headless build, comment this out. */
    Display_NetworkOutput(&pp_output, ts[1] - ts[0]);

    for (int i = 0; i < number_output; i++)
    {
      void *tmp = nn_out[i];
      SCB_InvalidateDCache_by_Addr(tmp, nn_out_len[i]);
    }
  }
}

static const char *Claritone_ZoneToString(claritone_zone_t zone)
{
  switch (zone)
  {
    case ZONE_LEFT:   return "LEFT";
    case ZONE_CENTER: return "CENTER";
    case ZONE_RIGHT:  return "RIGHT";
    default:          return "UNKNOWN";
  }
}

static claritone_zone_t Claritone_GetZone(float x_center)
{
  if (x_center < 0.33f)
  {
    return ZONE_LEFT;
  }
  else if (x_center < 0.66f)
  {
    return ZONE_CENTER;
  }
  else
  {
    return ZONE_RIGHT;
  }
}

static bool Claritone_IsPersonClass(int class_id)
{
  if (class_id < 0)
  {
    return false;
  }

  if (classes_table[class_id] == NULL)
  {
    return false;
  }

  return (strcmp(classes_table[class_id], "person") == 0);
}

static void Claritone_LogDetections(const od_pp_out_t *p_postprocess)
{
  od_pp_outBuffer_t *rois = p_postprocess->pOutBuff;
  uint32_t nb_rois = p_postprocess->nb_detect;

  for (uint32_t i = 0; i < nb_rois; i++)
  {
    claritone_zone_t zone = Claritone_GetZone(rois[i].x_center);

    printf("DET %lu: class=%ld label=%s conf=%.0f%% x=%.2f y=%.2f w=%.2f h=%.2f zone=%s\r\n",
           (unsigned long)i,
           (long)rois[i].class_index,
           classes_table[rois[i].class_index],
           rois[i].conf * 100.0f,
           rois[i].x_center,
           rois[i].y_center,
           rois[i].width,
           rois[i].height,
           Claritone_ZoneToString(zone));
  }
}

static claritone_target_t Claritone_SelectBestPerson(const od_pp_out_t *p_postprocess)
{
  claritone_target_t best = {0};
  od_pp_outBuffer_t *rois = p_postprocess->pOutBuff;
  uint32_t nb_rois = p_postprocess->nb_detect;

  for (uint32_t i = 0; i < nb_rois; i++)
  {
    if (!Claritone_IsPersonClass(rois[i].class_index))
    {
      continue;
    }

    if (!best.valid || (rois[i].conf > best.conf))
    {
      best.valid = true;
      best.class_id = rois[i].class_index;
      best.conf = rois[i].conf;
      best.x_center = rois[i].x_center;
      best.y_center = rois[i].y_center;
      best.width = rois[i].width;
      best.height = rois[i].height;
      best.zone = Claritone_GetZone(rois[i].x_center);
    }
  }

  return best;
}

static void Claritone_HandleFrame(const od_pp_out_t *p_postprocess)
{
  static uint32_t frame_counter = 0;
  frame_counter++;

  /* Print every 10th frame to reduce UART spam */
  if ((frame_counter % 10U) == 0U)
  {
    Claritone_LogDetections(p_postprocess);
  }

  claritone_target_t best_person = Claritone_SelectBestPerson(p_postprocess);

  if (best_person.valid)
  {
    printf("PERSON: zone=%s conf=%.0f%% x=%.2f y=%.2f\r\n",
           Claritone_ZoneToString(best_person.zone),
           best_person.conf * 100.0f,
           best_person.x_center,
           best_person.y_center);

    /* Future Claritone hook:
       - trigger ToF read here
       - convert ToF distance + zone into sound cue
       Example:
         uint16_t dist_mm = TOF_ReadMM();
         Claritone_PlayCue(best_person.zone, dist_mm);
    */
  }
}

static void Display_NetworkOutput(od_pp_out_t *p_postprocess, uint32_t inference_ms)
{
  od_pp_outBuffer_t *rois = p_postprocess->pOutBuff;
  uint32_t nb_rois = p_postprocess->nb_detect;
  int ret;

  __disable_irq();
  ret = SCRL_SetAddress_NoReload(lcd_fg_buffer[lcd_fg_buffer_rd_idx], SCRL_LAYER_1);
  assert(ret == HAL_OK);
  __enable_irq();

  UTIL_LCD_FillRect(0, 0, lcd_fg_area.XSize, lcd_fg_area.YSize, UTIL_LCD_COLOR_TRANSPARENT);

  for (int32_t i = 0; i < (int32_t)nb_rois; i++)
  {
    uint32_t x0 = (uint32_t)((rois[i].x_center - rois[i].width / 2) * ((float32_t)lcd_bg_area.XSize));
    uint32_t y0 = (uint32_t)((rois[i].y_center - rois[i].height / 2) * ((float32_t)lcd_bg_area.YSize));
    uint32_t width = (uint32_t)(rois[i].width * ((float32_t)lcd_bg_area.XSize));
    uint32_t height = (uint32_t)(rois[i].height * ((float32_t)lcd_bg_area.YSize));

    x0 = x0 < lcd_bg_area.XSize ? x0 : lcd_bg_area.XSize - 1;
    y0 = y0 < lcd_bg_area.YSize ? y0 : lcd_bg_area.YSize - 1;
    width = ((x0 + width) < lcd_bg_area.XSize) ? width : (lcd_bg_area.XSize - x0 - 1);
    height = ((y0 + height) < lcd_bg_area.YSize) ? height : (lcd_bg_area.YSize - y0 - 1);

    UTIL_LCD_DrawRect(x0, y0, width, height, colors[rois[i].class_index % NUMBER_COLORS]);
    UTIL_LCDEx_PrintfAt(x0, y0, LEFT_MODE, classes_table[rois[i].class_index]);
    UTIL_LCDEx_PrintfAt(-x0 - width, y0, RIGHT_MODE, "%.0f%%", rois[i].conf * 100.0f);
  }

  UTIL_LCD_SetBackColor(0x40000000);
  UTIL_LCDEx_PrintfAt(0, LINE(0), LEFT_MODE, "Inference");
  UTIL_LCDEx_PrintfAt(0, LINE(1), LEFT_MODE, "%ums", inference_ms);
  UTIL_LCDEx_PrintfAt(0, LINE(0), RIGHT_MODE, "Objects %u", nb_rois);
  UTIL_LCD_SetBackColor(0);

  Display_WelcomeScreen();

  SCB_CleanDCache_by_Addr(lcd_fg_buffer[lcd_fg_buffer_rd_idx], LCD_FG_FRAMEBUFFER_SIZE);
  __disable_irq();
  ret = SCRL_ReloadLayer(SCRL_LAYER_1);
  assert(ret == HAL_OK);
  __enable_irq();
  lcd_fg_buffer_rd_idx = 1 - lcd_fg_buffer_rd_idx;
}

static void Display_init(void)
{
  SCRL_LayerConfig layers_config[2] = {
    {
      .origin = {lcd_bg_area.X0, lcd_bg_area.Y0},
      .size = {lcd_bg_area.XSize, lcd_bg_area.YSize},
      .format = SCRL_RGB565,
      .address = lcd_bg_buffer,
    },
    {
      .origin = {lcd_fg_area.X0, lcd_fg_area.Y0},
      .size = {lcd_fg_area.XSize, lcd_fg_area.YSize},
      .format = SCRL_ARGB4444,
      .address = lcd_fg_buffer[lcd_fg_buffer_rd_idx],
    },
  };

